Tekla Open API Reference for Tekla Structures 2025
ContainerElement.Clear Method
 Removes all elements from the container instance.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public void Clear()
Public Sub Clear
See Also
Reference
ContainerElement Class
Tekla.Structures.Drawing Namespace